soda = {"บลูคูราโซ":30,
        "น้ำผึ้งแตงกว่า":25,
        "น้ำทับทิมซ่า":35,
        "กีวีมินต์โซดา":35 ,
        "พิ้งเลมอนเนดลิ้นจี่":35,
        "พันช์น้ำทับทิม":35,
        "มะยงชิดโซดา":35,
        "โชจูค็อกเทลน้ำทับทิมโซดา":45,
        "ม็อกเทลโซดา":50,
        "มะกรูดมะนาวโซดา":40}

milk = {"นม":20,
        "นมอัญชัน":25,
        "นมสตอว์เบอร์รี่":25,
        "เสาวรสนม":30,
        "นมบลูเบอร์รี่":35,
        "นมมะพร้าว":35,
        "นมสด":35,
        "ชาเย็น":45,
        "โอรีโอ้":50,
        "นมกล้วยสดไตล์เกาหลี":55}

cola = {"โค้ก" :25,
        "โค้กไม่มีน้ำตาล":25,
        "เปปซี่":25,
        "เปปซี่ไม่มีน้ำตาล":25,
        "สไปร์ท":25,
        "สไปร์ทไม่มีน้ำตาล":25,
        "น้ำเขียว":20,
        "น้ำแดง":20,
        "โค้กไม่มีน้ำตาลสูตรมาชเมลโล้":25,
        "เอส":20}

alcohol = {"ลีโอ":65,
        "ช้าง":55,
        "ซิง":45,
        "ซิงค์กระป๋อง":30,
        "โซจู":49 ,
        "วอดก้า":69 ,
        "วิสกี้":69}

water = {"น้ำเปล่า" : 10}

coffee = {"เอสเพรสโซ":28,
        "อเมริกาโน่":30,
        "ลาเต้":32,
        "คาปูชิโน่":32,
        "มอลค่า":40,
        "มัคคิอาโต้":45,
        "ลองแบล็ค":49,
        "เฟลทไวท์":49,
        "คาราเมล มัคคิโอโต้":59,
        "เดอร์ตี้ คอฟฟี่":49}

menu = ["soda","milk","cola","coffee","water","alcohol"]
def year_old() :
    global old
    while True : #รับค่าอายุ
        try :
            old = int(input("อายุของคุณ : "))
        except ValueError :
            print("กรุณาใส่เฉพาะ ตัวเลข เท่านั้น")
        else :
            if old <= 0 :
                print("กรุณากรอกอายุตามความเป็นจริง")
            else:
                break
        
        
year_old()

def topic() :
    print("\nDrink Topic : ")
    count = 0
    for i in menu : #เลขหน้าข้อความ
        count += 1
        print(f" {count} : {i}")
    print(" 7 : แก้ไขอายุ")
    

def mainmenu():
    topic()
    while True : #ลูป เลือกประเภทเครื่องดื่ม
            try : 
                select = int(input("select Topic : "))
            except ValueError :
                print("กรุณาใส่เฉพาะ ตัวเลข เท่านั้น")
            else :
                if select == 7 :
                    year_old()
                    topic()
                elif select > len(menu) or select < 1 : 
                    print("ไม่พบเมนูที่คุณต้องการ กรุณาเลือกใหม่")
                else :
                    if select == 1 :
                        return soda
                    elif select == 2 :
                        return milk
                    elif select == 3 :
                        return cola
                    elif select == 4 :
                        return coffee
                    elif select == 5 :
                        return water
                    elif select == 6 and old >= 18 :
                        return alcohol
                    elif select == 6 and old < 18 :
                        print("อายุของคุณน้อยกว่า 18 ปี ไม่สามารถซื้อ เครื่องดื่มประเภทแอลกอฮอร์ ได้")